#+begin_src emacs-lisp :results silent :tangle no
(setq org-babel-post-tangle-hook nil)
#+end_src

#+begin_src emacs-lisp :results silent :tangle no
  (defun re-root (new_directory bfn)
    (let (
          (fnd  (->
                 bfn file-name-directory
                 directory-file-name
                 file-name-nondirectory
                 file-name-as-directory))
          )
      (concat (file-name-as-directory new_directory) fnd (file-name-nondirectory bfn))))


  (add-hook 'org-babel-post-tangle-hook
            (lambda ()
              (let (
                    (new-root (re-root "/ssh:gardner:/gpfs/data/xhe-lab/software/ldsc/" buffer-file-name))
                    )
                (message "Copying file: %s to %s" buffer-file-name new-root)                
                (copy-file buffer-file-name new-root t)
                (message "Copied file: %s to %s" buffer-file-name new-root)                
                )))


#+end_src

*** Anno data

#+BEGIN_SRC R :mkdirp :tangle ../scripts/ldmr_annoplot_data.R


anno_files <- snakemake@input[["annof"]]
anno_names <- snakemake@params[["anno_names"]]
regid <- snakemake@params[["region_id"]]

  library(ldmap)
  library(stringr)
  library(EigenH5)
  library(tidyr)
  library(vroom)
  library(purrr)
  library(dplyr)

  anno_dff <- function(anno_files, anno_names, ldmrid) {
    map2_dfr(anno_files, anno_names, function(x, y) {
      read_bed(x, read_fun = purrr::partial(vroom::vroom, delim = "	")) %>%
        dplyr::filter(region_in_region(ldmap_region, ldetect_EUR,TRUE) == ldmrid) %>%
        mutate(anno = y)
    }) %>% mutate(ldmap_region=as_ldmap_region(ldmap_region))
  }




  stopifnot(!is.null(regid))


  anno_result_df <- anno_dff(anno_files, anno_names, as.integer(regid))



  saveRDS(anno_result_df, snakemake@output[["anno"]])

#+END_SRC




#+BEGIN_SRC R :mkdirp :tangle ../scripts/ldmr_pplot_data.R


    pipf <- snakemake@input[["pipf"]]
    gwasf <- snakemake@input[["gwasf"]]
    ldgf <- snakemake@input[["ldgf"]]
    regid <- snakemake@params[["region_id"]]
    priorf <- snakemake@input[["priorf"]]


#    #source("renv/activate.R")
    library(stringr)
    library(EigenH5)
    library(ldmap)
    library(readr)
    library(tidyr)
    library(vroom)
    library(purrr)
    library(dplyr)



    merge_gwas_susie <- function(gwas_h5, ldetect_rds, susie_rds, ldmrid, prior_rds) {
        stopifnot(
            !is.null(gwas_h5),
            !is.null(ldetect_rds),
            !is.null(susie_rds),
            all(file.exists(c(
                gwas_h5,
                ldetect_rds,
                susie_rds
            )))
        )

        susie_res <- readRDS(susie_rds)
        ldr <- readRDS(ldetect_rds) %>% slice(ldmrid)
        gwas_df <- read_df_h5(gwas_h5,
            "snp",
            subcols = c("snp_struct", "pval"),
            offset = as.integer(ldr$offset),
            datasize = as.integer(ldr$datasize)
        )
        prior_df <- readRDS(prior_rds)
        if (typeof(prior_df$SNP) == "character") {
            prior_df <- prior_df %>%
                separate(SNP, c("chrom", "pos", "ref", "alt"), convert = TRUE) %>%
                dplyr::mutate(chrom = as.integer(stringr::str_replace(chrom, "chr", ""))) %>%
                compact_snp_struct(snp_struct = "SNP")
        }
        ret_match <- dplyr::bind_cols(gwas_df, join_snp(
            gwas_df$snp_struct,
            prior_df$SNP
        )) %>%
            filter(!is.na(index)) %>%
            dplyr::select(snp_struct = match, index, pval)
        ret_match$prior <- prior_df$prior[ret_match$index]

        stopifnot(
            all(snp_in_region(range(ret_match$snp_struct), ldetect_EUR) == ldmrid),
            length(susie_res$alpha) == nrow(ret_match)
        )
        ret_match <- dplyr::select(ret_match, -index) %>%
            dplyr::mutate(pip = susie_res$pip, CS = FALSE)
        if(length(susie_res$sets$cs)!=1)
          return(ret_match)
        stopifnot(length(susie_res$sets$cs) == 1)
        ret_match$CS[susie_res$sets$cs[[1]]] <- TRUE
        return(ret_match)
    }




    stopifnot(!is.null(regid))

    gwas_result_df <- merge_gwas_susie(gwasf, ldgf, pipf, as.integer(regid), priorf)

    saveRDS(gwas_result_df, snakemake@output[["gwas"]])

#+END_SRC




#+BEGIN_SRC R :mkdirp :tangle ../scripts/ldmr_hicplot_data.R

    hic_file <- snakemake@input[["hic"]]
    regid <- snakemake@params[["region_id"]]


#    #source("renv/activate.R")
    library(stringr)
    library(readr)
    library(EigenH5)
    library(ldmap)
    library(tidyr)
    library(vroom)
    library(purrr)
    library(dplyr)

    hic_anno_dff <- function(hic_file, ldmrid) {
        cold <- cols(
            bait_chr = col_factor(paste0("chr", c(as.character(1:22), c("X", "Y")))),
            bait_start = col_double(),
            bait_end = col_double(),
            bait_name = col_character(),
            otherEnd_chr = col_factor(paste0("chr", c(as.character(1:22), c("X", "Y")))),
            otherEnd_start = col_double(),
            otherEnd_end = col_double(),
            otherEnd_name = col_character(),
            N_reads = col_double(),
            score = col_double()
        )
        ldmr <- ldetect_EUR[ldmrid]
        read_tsv(hic_file, col_names = names(cold$cols), col_types = cold, skip = 1L) %>%
            filter(bait_chr != "chrY", otherEnd_chr != "chrY") %>%
            compact_ldmap_region(chrom = "bait_chr", start = "bait_start", end = "bait_end", ldmap_region = "bait") %>%
            compact_ldmap_region(chrom = "otherEnd_chr", start = "otherEnd_start", end = "otherEnd_end", ldmap_region = "target") %>%
            filter(!is.na(region_in_region(bait,ldmr,TRUE)), !is.na(region_in_region(target,ldmr,TRUE)))
    }

    stopifnot(!is.null(regid))

    hic_result_df <- hic_anno_dff(hic_file,as.integer(regid))

    saveRDS(hic_result_df, snakemake@output[["hic"]])
#+END_SRC


#+BEGIN_SRC R :mkdirp :tangle ../scripts/ldmr_hicplot.R
#  #source("renv/activate.R")

  library(stringr)
  library(readr)
  library(EigenH5)
  library(ldmap)
  library(tidyr)
  library(vroom)
  library(purrr)
  library(dplyr)

  anno_file <- snakemake@input[["anno_file"]]
  region <- snakemake@params[["region"]]
  hic_file <- snakemake@input[["hic"]]
  null_file <- snakemake@input[["null_file"]]
  alt_file <- snakemake@input[["alt_file"]]

  pip_df <- inner_join(readRDS(null_file),
                       readRDS(alt_file),
                       by = c("snp_struct","pval"),
                       suffix = c("_null","_model")) %>%
    mutate(region_id = region)

  tfr <- pip_df %>%
    dplyr::arrange(snp_struct) %>%
    dplyr::mutate(lrmax = pmin(cummax(pip_model),rev(cummax(rev(pip_model))))) %>%
     dplyr::filter(lrmax > 1e-6)  %>% dplyr::pull(snp_struct)  %>% convex_hull()

    cs_df <-  dplyr::filter(pip_df,CS_model==TRUE)

  anno_df <- readRDS(anno_file) %>%
      mutate(region_id = region) %>%
      dplyr::filter(is_region_in_region(ldmap_region, tfr))

  hic_df <- readRDS(hic_file) %>%
      dplyr::mutate(region_id = y) %>%
    dplyr::filter(is_region_in_region(bait, tfr), is_region_in_region(target, tfr))

  bait_df <- dplyr::select(hic_df, ldmap_region = bait,
                           region_id) %>%
    mutate(anno = "DSC_Treated_HiC")

  target_df <- dplyr::select(hic_df, ldmap_region = target,
                             region_id) %>%
    mutate(anno = "DSC_Treated_HiC")

  plot_df <- bind_rows(anno_df,
                       bait_df,
                       target_df) %>%
    mutate(ldmap_region = as_ldmap_region(ldmap_region))


  midpoints <- function(x) {
      stopifnot(inherits(x, "ldmap_region"))
      return(starts(x) + round((ends(x) - starts(x)) / 2))
  }
  widths <- function(x) {
      stopifnot(inherits(x, "ldmap_region"))
      return(ends(x) - starts(x))
  }

  hlinel <- map(positions(cd_df$snp_struct), ~ geom_vline(xintercept = .x, col = "red", alpha = 0.2))

  add_plots <- function(proto, plot_list) {
      purrr::reduce(plot_list, `+`, .init = proto)
  }

  hicplotf <- function(reg) {
      fl <- focus_l[[reg]]

      hml <- hlinemapl[[reg]]
      df <- focus_hic_l[[reg]]

      tannogr <- focus_full_anno_l[[reg]] %>% dplyr::mutate(
          feature = str_remove(anno, "^.+dec-"),
          feature = str_remove(feature, "DSC_Treated_"),
          feat_fact = factor(feature)
      )

      df <- dplyr::mutate(df, feat_fact = factor("HiC", levels = levels(tannogr$feat_fact)))

      annoplot <- ggplot() +
          geom_tile(
              data = tannogr,
              aes(
                  x = midpoints(ldmap_region),
                  y = feat_fact,
                  width = widths(ldmap_region)
              ),
              height = .5
          ) +
          geom_curve(data = df, aes(
              x = midpoints(bait),
              y = feat_fact,
              xend = midpoints(target),
              yend = feat_fact
          )) +
          ylab("Functional Genomic Annotation") +
          xlab("Position") +
          xlim(c(starts(fl), ends(fl)))
      add_plots(annoplot, hml)
  }

  genel <- map(havegene_list, function(reg) {
      fl <- focus_l[[reg]]
      x <- focus_grtm[[reg]]
      y <- hlinemapl[[reg]]
      add_plots(x@ggplot + ylab("Genes") + xlim(c(starts(fl), ends(fl))), y)
  })
  fmplots <- list(gene = genel, anno = hicplots, ld = lddfl_vl) %>% pmap(function(gene, anno, ld) {
      (anno / gene / ld)
  })
  plan(multiprocess)

  od <- "/home/nwknoblauch/Dropbox/MOD paper 1/Fine_Mapping/"
  future_walk(seq_along(fmplots), function(i) {
      plt <- fmplots[[i]]
      name <- havegene_list[i]
      output_png <- fs::path(name, ext = "png")
      ggsave(filename = output_png, plot = plt, path = od)
  })


    library(EigenH5)
    cols <- rev(grDevices::colorRampPalette(c("#41AB5D","#BDBDBD"),
                                    space = "Lab")(200))
    ld_files <- fs::dir_ls("~/tmp/LD/",glob="*h5")
    ld_region <- str_replace(ld_files,".+/[0-9]+_([0-9]+).h5","\\1")
    ldf_df <- tibble(inputf=ld_files,region=ld_region) %>% dplyr::filter(region %in% names(focus_l))
    lddfl <- pmap(ldf_df,function(inputf,region){
      tfoc <- focus_l[[region]]
      tmpdf <- read_df_h5(inputf,"snp")
      tmpR <- read_matrix_h5(inputf,"R")
      tmpT <- as(tmpR, "dgTMatrix")
      upper <- (tmpT@i <= tmpT@j)
      df <- tibble(
        i = tmpT@i[upper], 
        j = tmpT@j[upper],
        r2 = tmpT@x[upper]^2
      ) %>% 
        mutate(isnp = tmpdf$snp_struct[i + 1],jsnp = tmpdf$snp_struct[j + 1]) %>% filter(positions(i) <=  positions(j)) %>% 
        mutate(y = (positions(jsnp) - positions(isnp)) / 2) %>% 
        dplyr::filter(is_snp_in_region(isnp,tfoc),is_snp_in_region(jsnp,tfoc)) %>%
        ggplot() +
        geom_point(aes(positions(isnp) + y, y, color = r2, alpha = r2), size = rel(0.5)) +
        scale_color_gradientn(colours=cols) +
        theme(axis.text.y = element_blank(),
              axis.ticks.y = element_blank()) +
        labs(x = "Position", y = NULL) +
        scale_alpha(guide = 'none')
    }) %>% set_names(ldf_df$region)

      focus_gr_list <- map(focus_l,function(ldmr) {
          chrp  <- paste0("chr",chromosomes(ldmr))
          start <- starts(ldmr)
          end <- ends(ldmr)

          return(GenomicRanges::GRanges(seqnames = chrp,ranges=IRanges::IRanges(start = start,end = end)))
        })
        focus_tgdl <- map(focus_gr_list,function(gr) {
          suppressMessages(tg_df <-
                             OrganismDbi::selectByRanges(
                                            x = Homo.sapiens,
                                            ranges = gr,
                                            columns = c("SYMBOL", "TXNAME")) %>%
                             as_tibble() %>%
                             dplyr::select(tx_name = TXNAME, symbol = SYMBOL) %>%
                             tidyr::unnest(cols = c(tx_name, symbol)))
          return(tg_df)
        })

      genefun <- function(tg_df,gr) {
        if(nrow(tg_df)>0){
          suppressMessages(gr.txdb <-
                             crunch(txdb, which = gr) %>%
                             tibble::as_tibble() %>%
                             dplyr::mutate(tx_name = as.character(tx_name)) %>%
                             dplyr::inner_join(tg_df) %>%
                             plyranges::as_granges() %>%
                             split(.$symbol))
        }else{
          gr.txdb <- GenomicRangesList()
          return(gr.txdb)
        }
      }


      focus_grtl <- map2(focus_tgdl, focus_gr_list, genefun)  %>% purrr::discard(~class(.x)=="SimpleGenomicRangesList")
      focus_grtm <- map(focus_grtl,autoplot)
      length(focus_grtl)

    txdb <- TxDb(Homo.sapiens)

#+END_SRC

#+BEGIN_SRC R :mkdirp :tangle ../scripts/ldmr_bigwigplot.R
  input_st
  inputf <- dir("/tmp",pattern="*bw",full.names=TRUE)
  susie_d <- "/home/nwknoblauch/Dropbox/Repos/ptb_workflowr/output/results/plot_data/susie"
  susie_f <- "/home/nwknoblauch/Dropbox/Repos/ptb_workflowr/output/results/plot_data/susie/ptb_treatedhic_512.RDS"
  susie_nullf <- "/home/nwknoblauch/Dropbox/Repos/ptb_workflowr/output/results/plot_data/susie/ptb_512.RDS"

  pip_df <- dplyr::inner_join(readRDS(susie_nullf),
                       readRDS(susie_f),by = c("snp_struct","pval"),suffix = c("_null","_model"))
  f_pip_df <- pip_df %>%  dplyr::arrange(snp_struct) %>% dplyr::mutate(lrmax = pmin(cummax(pmax(pip_model,pip_null)),rev(cummax(rev(pmax(pip_null,pip_model))))))
  fm_region <- dplyr::filter(f_pip_df,lrmax > 1e-6)  %>% dplyr::pull(snp_struct)  %>% convex_hull()
  region_r <- fm_region
  x <- inputf[1]

  library(rtracklayer)
  library(ldmap)
  #library(ggnomics)
  library(fs)
  library(purrr)
  library(dplyr)
  library(stringr)
  library(plyranges)
  library(Gviz)


  library(biovizBase)
  library(Homo.sapiens)
  library(readr)


  #exp <- example_HiC()
  #inputf <- snakemake@input[["bigwigs"]]
  fnames <- fs::path_ext_remove((fs::path_file(inputf)))
  mark <-  str_remove(fnames,"DSC[0-9]-.+-")
  treatment <-  str_replace(fnames,"DSC[0-9]-(.+)-.+","\\1")
  (sample <-  str_replace(fnames,"(DSC[0-9])-(.+)-.+","\\1"))
  input_df <- tibble::tibble(file=inputf,name=fnames,mark=mark,treatment=treatment,sample=sample)
  ## region <- 356L
  ## region_r <- ldetect_EUR[region]
  library(biomaRt)
  bm <- useMart(host="grch37.ensembl.org", biomart="ENSEMBL_MART_ENSEMBL", dataset="hsapiens_gene_ensembl")

  ## dTrack2 <- Gviz::DataTrack(range=x, genome="hg19", type="l", chromosome=paste0("chr",chromosomes(region_r)), name="bigwig")


  ## Gviz::plotTracks(dTrack2,from=starts(region_r),to=ends(region_r))
  focus_gr <- function(ldmr){
    chrp  <- paste0("chr",chromosomes(ldmr))
    start <- starts(ldmr)
    end <- ends(ldmr)

    return(GenomicRanges::GRanges(seqnames = chrp,ranges=IRanges::IRanges(start = start,end = end)))
  }

  region_r <- ldetect_EUR[512]
  gr <- focus_gr(region_r)
  sn <- as.character(seqnames(gr))
  biomTrack <- BiomartGeneRegionTrack(genome="hg19", chromosome=sn,start=starts(region_r),end=ends(region_r),geneSymbols=TRUE,name="ENSEMBL", filter=list(with_refseq_mrna=TRUE),biomart=bm,stacking="squish")

  top2 <- filter(pip_df, pip_model == max(pip_model))


  igrf <- function(tdf,ty){
    tyd <- ty$treatment
    inpl <- purrr::pmap(tdf, function(file, name, sample, ...){
      rtracklayer::import(file, which = gr)
    }) %>% plyranges::bind_regions() %>% disjoin_regions(score=mean(score)) 
    inpl %>% tibble::as_tibble() %>%
      dplyr::rename({{tyd}} := score) %>% 
      plyranges::as_granges()
  }

  ngrf <- function(idf,y, ...){
    rrangel <- group_by(idf,treatment) %>%
      group_map(igrf)  %>%  purrr::reduce(join_overlap_inner)
    dtrack <- Gviz::DataTrack(rrangel,groups=c("dec","unt"),name=glue::glue("{y$mark}"),type="hist",window=-1,windowSize=1500)
  }

  idf <- dplyr::filter(input_df,mark==mark[1])
  tdf <- filter(idf,treatment==treatment[1])
  rangel <- group_by(input_df,mark) %>% group_map(ngrf)

  trackl <- c(biomTrack,rangel)
  strt <- positions(top2$snp_struct)
  grangel <- HighlightTrack(trackl,chromosome=sn,start=strt,width=10)
  png(file="/home/nwknoblauch/Dropbox/Hand2.png")
  plotTracks(c(grangel),chromosome=sn,from=starts(region_r),to=ends(region_r))
  dev.off()

  GeneRegionTrack(txdb)
  rangeld <- lapply(rangel,function(df){
    mrk <- df$mark[1]
    df <- plyranges::select(df,-mark)
 
  })

    rangeldf <- bind_regions(rangel)


  plotTracks(rangeld,groups=c("DSC1","DSC2","DSC3"),type=c("a","p"))






  as_grange_df <- function(df, ...) {
    rl <- rlang::list2(...)
    explode_ldmap_region(df) %>%
      dplyr::rename(seqnames = chrom) %>%
      mutate(seqnames = as.character(seqnames)) %>%
      mutate(!!!rl) %>%
      plyranges::as_granges()
  }

  as_ldmr <- function(df) {
    tibble::as_tibble(df) %>%
      dplyr::mutate(seqnames = as.integer(stringr::str_remove(seqnames,"chr"))) %>% 
dplyr::select(-width) %>% 
      compact_ldmap_region(chrom = "seqnames")
  }


  read_df <- as_ldmr(ranged) %>% dplyr::select(-strand)
  pread_df <- tidyr::pivot_wider(read_df,names_from=c("mark","sample","treatment"),values_from=c("score"))
  ldmdf <- as_ldmr(out.gr)
#+END_SRC


#+BEGIN_SRC shell 

rsync -av rcc2:/project2/xinhe/software/ldsc/workflow/results ../workflow/results
#+END_SRC

#+RESULTS:
| receiving                                        | incremental | file                | list      |           |       |            |           |
| created                                          | directory   | ../workflow/results |           |           |       |            |           |
| results/                                         |             |                     |           |           |       |            |           |
| results/fgd/                                     |             |                     |           |           |       |            |           |
| results/fgd/clean_reproduciblemerged.log         |             |                     |           |           |       |            |           |
| results/fgd/clean_reproduciblemerged.results     |             |                     |           |           |       |            |           |
| results/fgd/clean_reproduciblemergedcsmc.log     |             |                     |           |           |       |            |           |
| results/fgd/clean_reproduciblemergedcsmc.results |             |                     |           |           |       |            |           |
| results/fgd/full_reproduciblemerged.log          |             |                     |           |           |       |            |           |
| results/fgd/full_reproduciblemerged.results      |             |                     |           |           |       |            |           |
| results/fgd/full_reproduciblemergedcsmc.log      |             |                     |           |           |       |            |           |
| results/fgd/full_reproduciblemergedcsmc.results  |             |                     |           |           |       |            |           |
| results/fgd/reproducible_merged.log              |             |                     |           |           |       |            |           |
| results/fgd/reproducible_merged.results          |             |                     |           |           |       |            |           |
| results/fgd/reproducible_up_down.log             |             |                     |           |           |       |            |           |
| results/fgd/reproducible_up_down.results         |             |                     |           |           |       |            |           |
| results/plot/                                    |             |                     |           |           |       |            |           |
| results/plot/LD/                                 |             |                     |           |           |       |            |           |
| results/plot/LD/15.RDS                           |             |                     |           |           |       |            |           |
| results/plot_data/                               |             |                     |           |           |       |            |           |
| results/plot_data/LD/                            |             |                     |           |           |       |            |           |
| results/plot_data/LD/15.RDS                      |             |                     |           |           |       |            |           |
| results/plot_data/anno/                          |             |                     |           |           |       |            |           |
| results/plot_data/anno/allhic_15.RDS             |             |                     |           |           |       |            |           |
| results/plot_data/anno/allhic_181.RDS            |             |                     |           |           |       |            |           |
| results/plot_data/anno/allhic_353.RDS            |             |                     |           |           |       |            |           |
| results/plot_data/anno/allhic_356.RDS            |             |                     |           |           |       |            |           |
| results/plot_data/anno/allhic_362.RDS            |             |                     |           |           |       |            |           |
| results/plot_data/anno/allhic_363.RDS            |             |                     |           |           |       |            |           |
| results/plot_data/anno/allhic_373.RDS            |             |                     |           |           |       |            |           |
| results/plot_data/anno/allhic_512.RDS            |             |                     |           |           |       |            |           |
| results/plot_data/anno/allhic_614.RDS            |             |                     |           |           |       |            |           |
| results/plot_data/anno/allhic_973.RDS            |             |                     |           |           |       |            |           |
| results/plot_data/genes/                         |             |                     |           |           |       |            |           |
| results/plot_data/genes/15.RDS                   |             |                     |           |           |       |            |           |
| results/plot_data/genes/15_genelist.txt.gz       |             |                     |           |           |       |            |           |
| results/plot_data/genes/181.RDS                  |             |                     |           |           |       |            |           |
| results/plot_data/genes/181_genelist.txt.gz      |             |                     |           |           |       |            |           |
| results/plot_data/genes/353.RDS                  |             |                     |           |           |       |            |           |
| results/plot_data/genes/353_genelist.txt.gz      |             |                     |           |           |       |            |           |
| results/plot_data/genes/356.RDS                  |             |                     |           |           |       |            |           |
| results/plot_data/genes/356_genelist.txt.gz      |             |                     |           |           |       |            |           |
| results/plot_data/genes/362.RDS                  |             |                     |           |           |       |            |           |
| results/plot_data/genes/362_genelist.txt.gz      |             |                     |           |           |       |            |           |
| results/plot_data/genes/363.RDS                  |             |                     |           |           |       |            |           |
| results/plot_data/genes/363_genelist.txt.gz      |             |                     |           |           |       |            |           |
| results/plot_data/genes/373.RDS                  |             |                     |           |           |       |            |           |
| results/plot_data/genes/373_genelist.txt.gz      |             |                     |           |           |       |            |           |
| results/plot_data/genes/512.RDS                  |             |                     |           |           |       |            |           |
| results/plot_data/genes/512_genelist.txt.gz      |             |                     |           |           |       |            |           |
| results/plot_data/genes/614.RDS                  |             |                     |           |           |       |            |           |
| results/plot_data/genes/614_genelist.txt.gz      |             |                     |           |           |       |            |           |
| results/plot_data/genes/973.RDS                  |             |                     |           |           |       |            |           |
| results/plot_data/genes/973_genelist.txt.gz      |             |                     |           |           |       |            |           |
| results/plot_data/hic/                           |             |                     |           |           |       |            |           |
| results/plot_data/hic/15.RDS                     |             |                     |           |           |       |            |           |
| results/plot_data/hic/181.RDS                    |             |                     |           |           |       |            |           |
| results/plot_data/hic/353.RDS                    |             |                     |           |           |       |            |           |
| results/plot_data/hic/356.RDS                    |             |                     |           |           |       |            |           |
| results/plot_data/hic/362.RDS                    |             |                     |           |           |       |            |           |
| results/plot_data/hic/363.RDS                    |             |                     |           |           |       |            |           |
| results/plot_data/hic/373.RDS                    |             |                     |           |           |       |            |           |
| results/plot_data/hic/512.RDS                    |             |                     |           |           |       |            |           |
| results/plot_data/hic/614.RDS                    |             |                     |           |           |       |            |           |
| results/plot_data/hic/973.RDS                    |             |                     |           |           |       |            |           |
| results/plot_data/susie/                         |             |                     |           |           |       |            |           |
| results/plot_data/susie/ptb_allhic_15.RDS        |             |                     |           |           |       |            |           |
| results/plot_data/susie/ptb_allhic_181.RDS       |             |                     |           |           |       |            |           |
| results/plot_data/susie/ptb_allhic_353.RDS       |             |                     |           |           |       |            |           |
| results/plot_data/susie/ptb_allhic_356.RDS       |             |                     |           |           |       |            |           |
| results/plot_data/susie/ptb_allhic_362.RDS       |             |                     |           |           |       |            |           |
| results/plot_data/susie/ptb_allhic_363.RDS       |             |                     |           |           |       |            |           |
| results/plot_data/susie/ptb_allhic_373.RDS       |             |                     |           |           |       |            |           |
| results/plot_data/susie/ptb_allhic_512.RDS       |             |                     |           |           |       |            |           |
| results/plot_data/susie/ptb_allhic_614.RDS       |             |                     |           |           |       |            |           |
| results/ptb/                                     |             |                     |           |           |       |            |           |
| results/ptb/clean_reproduciblemerged.log         |             |                     |           |           |       |            |           |
| results/ptb/clean_reproduciblemerged.results     |             |                     |           |           |       |            |           |
| results/ptb/clean_reproduciblemergedcsmc.log     |             |                     |           |           |       |            |           |
| results/ptb/clean_reproduciblemergedcsmc.results |             |                     |           |           |       |            |           |
| results/ptb/full_reproduciblemerged.log          |             |                     |           |           |       |            |           |
| results/ptb/full_reproduciblemerged.results      |             |                     |           |           |       |            |           |
| results/ptb/full_reproduciblemergedcsmc.log      |             |                     |           |           |       |            |           |
| results/ptb/full_reproduciblemergedcsmc.results  |             |                     |           |           |       |            |           |
| results/ptb/reproducible_merged.log              |             |                     |           |           |       |            |           |
| results/ptb/reproducible_merged.results          |             |                     |           |           |       |            |           |
| results/ptb/reproducible_up_down.log             |             |                     |           |           |       |            |           |
| results/ptb/reproducible_up_down.results         |             |                     |           |           |       |            |           |
|                                                  |             |                     |           |           |       |            |           |
| sent                                             | 1,480       | bytes               | received  | 8,011,197 | bytes | 942,667.88 | bytes/sec |
| total                                            | size        | is                  | 8,005,117 | speedup   | is    |        1.0 |           |



